In [1]:
#cust_demo.csv

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings('ignore')

In [3]:
df1=pd.read_csv("cust_demo.csv")

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149956 entries, 0 to 149955
Data columns (total 8 columns):
ID                    149956 non-null int64
Location              149956 non-null object
Gender                149956 non-null int64
age                   149956 non-null int64
Martial_Status        149956 non-null object
NumberOfDependents    146033 non-null float64
Own_House             149956 non-null int64
No_Years_address      149956 non-null int64
dtypes: float64(1), int64(5), object(2)
memory usage: 9.2+ MB

In [5]:
df1.head()

,ID,Location,Gender,age,Martial_Status,NumberOfDependents,Own_House,No_Years_address
0,4532,"Gandhinagar,Gujarat",0,39,Single,1.0,1,3
1,148736,"Hyderabad,Andhra Pradesh",0,52,Married,0.0,0,3
2,95965,"Shimla,Himachal Pradesh",0,62,Married,0.0,0,2
3,61759,"Srinagar,JK",0,42,Single,1.0,1,1
4,49806,"Imphal,Manipur",0,41,Single,1.0,0,3

In [6]:
df1.isnull().sum()

ID                       0
Location                 0
Gender                   0
age                      0
Martial_Status           0
NumberOfDependents    3923
Own_House                0
No_Years_address         0
dtype: int64

In [7]:
#find percentage of null values in "NumberOfDependents columns
df1["NumberOfDependents"].isnull().sum()/df1.shape[0]*100

2.616100722878711

In [8]:
df1["NumberOfDependents"].fillna(df1["NumberOfDependents"].median(),inplace=True)

In [9]:
df1["NumberOfDependents"].unique()

array([ 1.,  0.,  3.,  2.,  5.,  4.,  6.,  7.,  8., 10.,  9., 20., 13.])

In [10]:
df1.isnull().sum()

ID                    0
Location              0
Gender                0
age                   0
Martial_Status        0
NumberOfDependents    0
Own_House             0
No_Years_address      0
dtype: int64

In [11]:
#to remove unwanted column ID 
df1.drop("ID",axis=1,inplace=True)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149956 entries, 0 to 149955
Data columns (total 7 columns):
Location              149956 non-null object
Gender                149956 non-null int64
age                   149956 non-null int64
Martial_Status        149956 non-null object
NumberOfDependents    149956 non-null float64
Own_House             149956 non-null int64
No_Years_address      149956 non-null int64
dtypes: float64(1), int64(4), object(2)
memory usage: 8.0+ MB

In [13]:
df_num=df1.select_dtypes(['int64','float64'])
df_cat=df1.select_dtypes('object')

In [14]:
# Now we convert categorical part into numerical part using Label Encoder
from sklearn.preprocessing import LabelEncoder

In [15]:
le=LabelEncoder()

In [16]:
df_cat.head()

                   Location Martial_Status
0       Gandhinagar,Gujarat         Single
1  Hyderabad,Andhra Pradesh        Married
2   Shimla,Himachal Pradesh        Married
3               Srinagar,JK         Single
4            Imphal,Manipur         Single

In [17]:
for i in list(df_cat.columns):
    df_cat[i]=le.fit_transform(df_cat[i])

In [18]:
df_cat.head()

   Location  Martial_Status
0         9               1
1        11               0
2        25               0
3        26               1
4        12               1

In [19]:
df1_new=pd.concat([df_cat,df_num],axis=1)

In [20]:
df1_new.head()

,Location,Martial_Status,Gender,age,NumberOfDependents,Own_House,No_Years_address
0,9,1,0,39,1.0,1,3
1,11,0,0,52,0.0,0,3
2,25,0,0,62,0.0,0,2
3,26,1,0,42,1.0,1,1
4,12,1,0,41,1.0,0,3